def area_square():
    print("_______________________________________")
    print("โปรแกรมคำนวณหาพื้นที่ 4 เหลี่ยมจตุรัส")
    square = int(input("ใส่ความยาวด้าน: "))
    square1 = square*square
    print(f"พื้นที่ 4 เหลี่ยมจตุรัสนี้ คือ {square1}")
    print("_______________________________________")

def area_square2():
    print("_______________________________________")
    print("โปรแกรมคำนวณหาพื้นที่ 4 เหลี่ยมผืนผ้า")
    weight = int(input("ส่ความกว้าง: "))
    height = int(input("ใส่ความยาว: "))
    square2 = weight*height
    print(f"พื้นที่ 4 เหลี่ยมผืนผ้านี้ คือ {square2}")
    print("_______________________________________")

def area_circle():
    print("_______________________________________")
    print("โปรแกรมคำนวณหาพื้นที่วงกลม")
    r = float(input("ใส่ความยาวของรัศมี: "))
    circle = 3.14*(r**2)
    print(f"พื้นที่ 4 เหลี่ยมวงกลมนี้ คือ {circle}")
    print("_______________________________________")

def rps_game():
    import random
    print("โปรแกรมเป่ายิงฉุบ")
    while True :
        a = random.choice(["ค้อน","กรรไกร","กระดาษ"])
        user = input("พิมพ์ ค้อน,กรรไกร,กระดาษ : ")
        if a == user :
            if a == "กรรไกร" :
                print("เสมอ เพราะ กรรไกรเหมือนกัน")
                print("_______________________________________")
            elif a == "ค้อน" :
                print("เสมอ เพราะ ค้อนเหมือนกัน")
                print("_______________________________________")
            elif a == "กระดาษ" :
                print("เสมอ เพราะ กระดาษเหมือนกัน")
                print("_______________________________________")
            break
        elif user == "ค้อน" and a == "กรรไกร":
            print("คุณชนะ")
            print("_______________________________________")
            break
        elif user == "กรรไกร" and a == "กระดาษ":
            print("คุณชนะ")
            print("_______________________________________")
            break
        elif user == "กระดาษ" and a == "ค้อน":
            print("คุณชนะ")
            print("_______________________________________")
            break
        else:
            print("คุณแพ้")
            print("_______________________________________")
            break

def choice_return():
    while True:
        print("กรุณาเลือกโปรโปรแกรมที่ใช้งาน")
        print("กด 1 = โปรแกรมหาพื้นที่")
        print("กด 2 = โปรแกรมเป่ายิงฉุบ")
        print("กด 0 = ยกเลิกโปรแกรม")
        choice = int(input("พิมพ์โปรแกรมที่ต้องการ : "))
        print("_______________________________________")
        if choice == 1:
            print("เลือกรูปทรงที่ต้องการหาพื้นที่")
            print("กด 1 = พื้นที่สี่เหลี่ยม")
            print("กด 2 = พื้นที่สี่เหลี่ยมผืนผ้า")
            print("กด 3 = พื้นที่วงกลม")
            print("กด 4 = ย้อนกลับ")
            c2 = int(input("พิมพ์พื้นที่ที่ต้องการหา : "))
            if c2 == 1:
                area_square()
            elif c2 == 2:
                area_square2()
            elif c2 == 3:
                area_circle()
            elif c2 == 4:
                print("_______________________________________")
                choice_return()
        elif choice == 2:
            rps_game()
            print("กด 1 = เล่นอีกครั้ง")
            print("กด 2 = ย้อนกลับ")
            print("กด 3 = ปิดโปรแกรม")
            c3 = int(input("เลือกที่ต้องการที่นี่ : "))
            if c3 == 1:
                print("_______________________________________")
                rps_game()
                return_rps_game()
                break
            elif c3 == 2:
                print("_______________________________________")
                choice_return()
            elif c3 == 3:
                print("_______________________________________")
                print("\nยกเลิกโปรแกรมสำเร็จ\n")
                break
        elif choice == 0:
            print("\nยกเลิกโปรแกรมสำเร็จ\n")
            break
        else:
            print("\nเกิดข้อผิดพลาด กรอกแค่ 1,2,0\n")


def return_rps_game():
    while True :
        print("กด 1 = เล่นอีกครั้ง")
        print("กด 2 = ย้อนกลับ")
        print("กด 3 = ปิดโปรแกรม")
        c3 = int(input("เลือกที่ต้องการที่นี่ : "))
        if c3 == 1:
            print("_______________________________________")
            rps_game()
        elif c3 == 2:
            print("_______________________________________")
            choice_return()
        elif c3 == 3:
            print("_______________________________________")
            print("\nยกเลิกโปรแกรมสำเร็จ\n")
            break



while True:
    print("กรุณาเลือกโปรโปรแกรมที่ใช้งาน")
    print("กด 1 = โปรแกรมหาพื้นที่")
    print("กด 2 = โปรแกรมเป่ายิงฉุบ")
    print("กด 0 = ยกเลิกโปรแกรม")
    choice = int(input("พิมพ์โปรแกรมที่ต้องการ : "))
    print("_______________________________________")
    if choice == 1:
        print("เลือกรูปทรงที่ต้องการหาพื้นที่")
        print("กด 1 = พื้นที่สี่เหลี่ยม")
        print("กด 2 = พื้นที่สี่เหลี่ยมผืนผ้า")
        print("กด 3 = พื้นที่วงกลม")
        print("กด 4 = ย้อนกลับ")
        c2 = int(input("พิมพ์พื้นที่ที่ต้องการหา : "))
        if c2 == 1:
            area_square()
        elif c2 == 2:
            area_square2()
        elif c2 == 3:
            area_circle()
        elif c2 == 4:
            print("_______________________________________")
            choice_return()
    elif choice == 2:
        rps_game()
        print("กด 1 = เล่นอีกครั้ง")
        print("กด 2 = ย้อนกลับ")
        print("กด 3 = ปิดโปรแกรม")
        c3 = int(input("เลือกที่ต้องการที่นี่ : "))
        if c3 == 1:
            print("_______________________________________")
            rps_game()
            return_rps_game()
            break
        elif c3 == 2:
            print("_______________________________________")
            choice_return()
        elif c3 == 3:
            print("_______________________________________")
            print("\nยกเลิกโปรแกรมสำเร็จ\n")
            break
    elif choice == 0:
        print("\nยกเลิกโปรแกรมสำเร็จ\n")
        break
    else:
        print("\nเกิดข้อผิดพลาด กรอกแค่ 1,2,0\n")


    




