print("╔═════════════════ʕ◉ᴥ◉ʔ═════════════════╗\n")
print("      คำนวณหาพื้นที่ 4 เหลี่ยมจตุรัส")
square = int(input("      ใส่ความยาวด้าน: "))
square1 = square*square
print(f"      ☛  พื้นที่ 4 เหลี่ยมจตุรัสนี้ คือ {square1}\n\n")

print("      คำนวณหาพื้นที่ 4 เหลี่ยมผืนผ้า")
weight = int(input("      ใส่ความกว้าง: "))
height = int(input("      ใส่ความยาว: "))
square2 = weight*height
print(f"      ☛  พื้นที่ 4 เหลี่ยมผืนผ้านี้ คือ {square2}\n\n")

print("      คำนวณหาพื้นที่วงกลม")
r = float(input("      ใส่ความยาวของรัศมี: "))
circle = 3.14*(r**2)
print(f"      ☛  พื้นที่ 4 เหลี่ยมวงกลมนี้ คือ {circle}\n")
print("╚═════════════════ஓ๑♡๑ஓ═════════════════╝")
44